enum class Strings(val code: String) {
    EXT("0"),
    EXT_TEXT ("Выход"),
    NEW("1"),
    NEW_ARCH("Создать новый архив"),
    NEW_NOTE("Создать новую заметку"),
    MENU_SEPARATOR("_________________________________________________________"),
    SEL_ITEM_REQST("Введите число:"),
    NEW_NAME_REQST("Введите название:"),
    NEW_TEXT_REQST("Введите текст:"),
    ERR_ELEM_EXIST("Ошибка! Такой элемент уже существует!"),
    ERR_INPT_TYPES("Ошибка ввода, необходимо ввести число!"),
    ERR_INPT_RANGE("Ошибка ввода, введите число, соответствующее пункту меню!");
}
